import UserHeader from "../components/UserHeader";

const ToS = () => {
  return (
    <>
      <UserHeader>이용 약관 및 정책</UserHeader>
      <div>
        제1조(목적) 이 약관은 유스프레이 (이하 '회사' 라고 합니다)가 제공하는
        제반 서비스의 이용과 관련하 여 회사와 회원과의 권리, 의무 및 책임사항,
        기타 필요한 사항을 규정함을 목적으로 합니 다. 제2조(정의) 이 약관에서
        사용하는 주요 용어의 정의는 다음과 같습니다. 1. '서비스'라 함은 구현되는
        단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포 함)와 상관없이
        '이용자'가 이용할 수 있는 회사가 제공하는 제반 서비스를 의미합니 다. 2.
        '이용자'란 이 약관에 따라 회사가 제공하는 서비스를 받는 '개인회원',
        '기업회원' 및 '비회원'을 말합니다. 3. '개인회원'은 회사에 개인정보를
        제공하여 회원등록을 한 사람으로, 회사로부터 지속 적으로 정보를 제공받고
        '회사'가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다. 4.
        '기업회원'은 회사에 기업정보 및 개인정보를 제공하여 회원등록을 한
        사람으로, 회사 로부터 지속적으로 정보를 제공받고 회사가 제공하는
        서비스를 계속적으로 이용할 수 있는 자를 말합니다. 5. '비회원'은 회원가입
        없이 회사가 제공하는 서비스를 이용하는 자를 말합니다. 5. '비회원'은
        회원가입 없이 회사가 제공하는 서비스를 이용하는 자를 말합니다. 6.
        '아이디(ID)'라 함은 회원의 식별과 서비스이용을 위하여 회원이 정하고
        회사가 승인 하는 문자 또는 문자와 숫자의 조합을 의미합니다. 7.
        '비밀번호'라 함은 회원이 부여받은 아이디와 일치되는 회원임을 확인하고
        비밀의 보 호를 위해 회원 자신이 정한 문자(특수문자 포함)와 숫자의 조합을
        의미합니다. 8. '유료서비스'라 함은 회사가 유료로 제공하는 제반 서비스를
        의미합니다. 9. '결제'란 회사가 제공하는 유료서비스를 이용하기 위하여
        회원이 지불수단을 선택하 고, 금융정보를 입력하는 행위를 말합니다. 10.
        'Google Play 결제 시스템'(은)는 회사가 제공하는 유료서비스를 이용하기
        위해 구 매하는 인터넷 상의 결제수단으로 현금 1원당 Google Play 결제
        시스템 1의 비율 로 환산되며, 회원의 아이디(ID)를 기준으로 충전, 결제,
        환불 등이 가능합니다. 11. '콘텐츠'란 정보통신망법의 규정에 따라
        정보통신망에서 사용되는 부호·문자·음성·음 향·이미지 또는 영상 등으로
        정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 말합니다.
        제3조(약관 외 준칙) 이 약관에서 정하지 아니한 사항에 대해서는 법령 또는
        회사가 정한 서비스의 개별약관, 운 영정책 및 규칙 등(이하 세부지침)의
        규정에 따릅니다. 또한 본 약관과 세부지침이 충돌할 경우에는 세부지침에
        따릅니다. 제4조(약관의 효력과 변경) 1. 이 약관은 유스프레이(이)가
        제공하는 모든 인터넷서비스에 게시하여 공시합니다. 회 사는
        '전자상거래등에서의 소비자보호에 관한 법률(이하 '전자상거래법'이라 함)',
      </div>
    </>
  );
};

export default ToS;
